// *++
	//
// Copyright (c) 2007, Intel Corporation                                                         
// All rights reserved. This program and the accompanying materials                          
// are licensed and made available under the terms and conditions of the BSD License         
// which accompanies this distribution.  The full text of the license may be found at        
// http://opensource.org/licenses/bsd-license.php                                            
//                                                                                           
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,                     
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.             
// 
// Module Name:
//
//   VfrStrings.vfr
// 
// Abstract:
// 
//   String definitions for platform driver override manager formset.
// 
// 
// --*/


/=#

#langdef eng "English"
#langdef fra "Francais"


#string STR_ENTRY_TITLE                           #language eng  "Platform Driver Override selection"
                                                  #language fra  "French: Platform Driver Override selection"
#string STR_TITLE                                 #language eng  " "
                                                  #language fra  " "
#string STR_TITLE_HELP                            #language eng  "Select driver connection order as platform policy for sepcific controller"
                                                  #language fra  "French: Select driver connection order as platform policy for sepcific controller"
#string STR_TITLE_ORDER                           #language eng  "Order Platform Override driver priority"
                                                  #language fra  "French: Order Platform Override driver priority"
#string STR_TITLE_ORDER_HELP                      #language eng  "Select the drivers you need to add as previous controller's override driver in the following check box, and go on to order them priority in this entry. '?' means you have not select the driver"
                                                  #language fra  "French: Select the drivers you need to add as previous controller's override driver in the following check box, and go on to order them priority in this entry. '?' means you have not select the driver"
#string STR_FIRST_REFRESH                         #language eng  "Please refresh page firstly"
                                                  #language fra  "French: Please Refresh page firstly"
#string STR_FIRST_REFRESH_HELP                    #language eng  "When enter the page at first time, refresh is needed to show all the controller device pathes"
                                                  #language fra  "French: When enter the page at first time, refresh is needed to show all the controller device pathes"
#string STR_REFRESH                               #language eng  "Refresh"
                                                  #language fra  "French: Refresh"
#string STR_REFRESH_HELP                          #language eng  "Refresh to show all the current controllers device pathes"
                                                  #language fra  "French: Refresh to show all the current controllers device pathes"
#string STR_PCI_DEVICE_FILTER_PROMPT              #language eng  "Pci device filter"
                                                  #language fra  "French: Pci device filter"
#string STR_PCI_DEVICE_FILTER_HELP                #language eng  "Only show the pci device which has efi driver in its option rom"
                                                  #language fra  "French: Only show the pci device which has efi driver in its option rom"
#string STR_DRIVER_DEFAULT_NAME                   #language eng  "Driver Default Name"
                                                  #language fra  "French: Driver Default Name"
#string STR_GOTO_HELP_DRIVER                      #language eng  "Select the controller device path which you need combine override drivers, '**' means you have saved its info before"
                                                  #language fra  "French: Select the controller device path which you need combine override drivers"
#string STR_NULL_STRING                           #language eng  ""
                                                  #language fra  ""
#string STR_GOTO_PREVIOUS                         #language eng  "Go to Previous Menu"
#string STR_SAVE_AND_EXIT                         #language eng  "Commit Changes"
                                                  #language fra  "Commit Changes"
